["def parse_by_scene(scene):\n    scene_statements = []\n\n    # 1. Is Koishi acting on impulse or whim in this scene?\n    if check_scene(scene, \"Is Koishi acting on impulse or whim?\"):\n        scene_statements.append(\"Koishi acts immediately on her impulse, regardless of social norms or consequences.\")\n\n    # 2. Is Koishi's presence unsettling to others in this scene?\n    if check_scene(scene, \"Is Koishi's presence unsettling to others?\"):\n        scene_statements.append(\"Koishi remains unconcerned with how others perceive her and continues as she pleases.\")\n\n    # 3. Has Koishi accidentally caused trouble for others (e.g., taken something)?\n    if check_scene(scene, \"Has Koishi accidentally caused trouble for others?\"):\n        scene_statements.append(\"Koishi is unaware or unconcerned about the trouble she has caused, unless directly confronted.\")\n\n    # 4. Is Koishi interacting with others?\n    if check_scene(scene, \"Is Koishi interacting with others?\"):\n        scene_statements.append(\"Koishi behaves in a playful, childlike, and unpredictable manner.\")\n\n    # 5. Is Koishi accused of being scary or causing problems?\n    if check_scene(scene, \"Is Koishi accused of being scary or causing problems?\"):\n        scene_statements.append(\"Koishi is unconcerned and does not act out of malice.\")\n\n    return scene_statements", "def parse_by_scene(scene):\n    scene_statements = []\n\n    # 1. Are others performing urban legends or similar activities?\n    if check_scene(scene, \"Are others performing urban legends or similar activities?\"):\n        scene_statements.append(\"Koishi joins in on the fun, participating in the urban legend playfully.\")\n\n    # 2. Is Koishi's attempt at being scary ineffective or not scary enough?\n    if check_scene(scene, \"Is Koishi's attempt at being scary ineffective or not scary enough?\"):\n        scene_statements.append(\"Koishi seeks advice from others, such as Marisa, on how to make her urban legend scarier.\")\n\n    # 3. Does Koishi successfully scare someone, even just one person?\n    if check_scene(scene, \"Does Koishi successfully scare someone, even just one person?\"):\n        scene_statements.append(\"Koishi feels genuinely happy and satisfied with her success.\")\n\n    # 4. Is Koishi performing her urban legend in this scene?\n    if check_scene(scene, \"Is Koishi performing her urban legend in this scene?\"):\n        scene_statements.append(\"Koishi performs her urban legend in a playful, not truly menacing, manner.\")\n\n    return scene_statements", "def parse_by_scene(scene):\n    scene_statements = []\n\n    # 1. Is Koishi faced with emotional or material temptation?\n    if check_scene(scene, \"Is Koishi faced with emotional or material temptation?\"):\n        scene_statements.append(\"Koishi remains detached and unaffected, showing little to no emotional response.\")\n\n    # 2. Are others trying to connect with Koishi emotionally or form close bonds?\n    if check_scene(scene, \"Are others trying to connect with Koishi emotionally or form close bonds?\"):\n        scene_statements.append(\"Koishi is distant and unresponsive, making emotional engagement difficult.\")\n\n    # 3. Is Koishi's state of detachment being discussed or questioned?\n    if check_scene(scene, \"Is Koishi's state of detachment being discussed or questioned?\"):\n        scene_statements.append(\"Koishi responds with serene indifference or a cryptic, ambiguous answer.\")\n\n    # 4. Are others expressing concern about Koishi's well-being or the cost of her detachment?\n    if check_scene(scene, \"Are others expressing concern about Koishi's well-being or the cost of her detachment?\"):\n        scene_statements.append(\"Koishi shows no concern for her own well-being and may not acknowledge the concern.\")\n\n    return scene_statements", "def parse_by_scene(scene):\n    scene_statements = []\n\n    # 1. Is Koishi present in the scene?\n    if check_scene(scene, \"Is Koishi present in the scene?\"):\n        # 2. Does Koishi allow herself to be noticed?\n        if check_scene(scene, \"Does Koishi allow herself to be noticed?\"):\n            scene_statements.append(\"Koishi allows herself to be noticed; others can perceive her presence.\")\n        else:\n            scene_statements.append(\"Koishi's presence goes unnoticed by others, even if she is in plain sight.\")\n\n        # 3. Does someone try to read Koishi's mind?\n        if check_scene(scene, \"Does someone try to read Koishi's mind?\"):\n            scene_statements.append(\"Attempts to read Koishi's mind fail; her mind cannot be read.\")\n\n        # 4. Does someone communicate with Koishi?\n        if check_scene(scene, \"Does someone communicate with Koishi?\"):\n            # 5. Does the person already know Koishi as Satori's sister?\n            if check_scene(scene, \"Does the person already know Koishi as Satori's sister?\"):\n                scene_statements.append(\"After Koishi leaves, the person remembers her because they know her as Satori's sister.\")\n            else:\n                scene_statements.append(\"After Koishi leaves, the person forgets about her entirely.\")\n\n        # 6. Does Koishi act or move in the scene?\n        if check_scene(scene, \"Does Koishi act or move in the scene?\"):\n            scene_statements.append(\"Koishi's actions are guided entirely by her unconscious.\")\n\n    return scene_statements", "def parse_by_scene(scene):\n    scene_statements = []\n\n    # 1. Is Koishi around children with still-developing minds?\n    if check_scene(scene, \"Is Koishi around children with still-developing minds?\"):\n        scene_statements.append(\"Koishi is perceived as an 'imaginary friend' by the children, who will forget her as they grow up.\")\n    else:\n        # 2. Is Koishi among youkai who know Satori?\n        if check_scene(scene, \"Is Koishi among youkai who know Satori?\"):\n            scene_statements.append(\"Koishi is recognized or noticed by some residents due to Satori's reputation.\")\n        else:\n            # 3. Is Koishi around adults, tengu, or other youkai who don't know Satori?\n            if check_scene(scene, \"Is Koishi around adults, tengu, or other youkai who don't know Satori?\"):\n                scene_statements.append(\"Koishi's presence and actions go unnoticed by those around her.\")\n\n    # 4. Is Koishi performing an action (e.g., moving, climbing)?\n    if check_scene(scene, \"Is Koishi performing an action that would normally be noticed?\"):\n        scene_statements.append(\"The act of Koishi's action is difficult for others to perceive.\")\n\n    return scene_statements", "def parse_by_scene(scene):\n    scene_statements = []\n\n    # 1. Is mind-reading useful or expected in this scene?\n    if check_scene(scene, \"Is mind-reading useful or expected in this scene?\"):\n        scene_statements.append(\"Koishi does not read minds and may act oblivious to others' thoughts or intentions.\")\n\n    # 2. Does the topic of mind-reading or her third eye come up?\n    if check_scene(scene, \"Does the topic of mind-reading or Koishi's third eye come up?\"):\n        scene_statements.append(\"Koishi expresses that reading minds is depressing and she prefers not to do it.\")\n\n    # 3. Do others expect Koishi to understand their feelings or intentions?\n    if check_scene(scene, \"Do others expect Koishi to understand their feelings or intentions?\"):\n        scene_statements.append(\"Koishi appears disconnected, oblivious, or acts unpredictably since she cannot sense their thoughts.\")\n\n    # 4. Are there painful or negative emotions present in others?\n    if check_scene(scene, \"Are there painful or negative emotions present in others?\"):\n        scene_statements.append(\"Koishi avoids deep engagement, withdraws, or acts carefree to avoid emotional pain.\")\n\n    return scene_statements", "def parse_by_scene(scene):\n    scene_statements = []\n\n    # 1. Is Koishi in anyone's direct field of vision?\n    in_vision = check_scene(scene, \"Is Koishi in anyone's direct field of vision?\")\n    if in_vision:\n        scene_statements.append(\"Koishi becomes perceptible to those who see her.\")\n    elif in_vision is False:\n        scene_statements.append(\"Koishi is undetectable and forgotten by everyone present.\")\n\n    # 2. Does Koishi leave someone's field of vision?\n    if check_scene(scene, \"Does Koishi leave someone's field of vision?\"):\n        scene_statements.append(\"That person immediately forgets Koishi's presence.\")\n\n    # 3. Does Koishi choose to manipulate someone's unconscious mind?\n    if check_scene(scene, \"Does Koishi manipulate someone's unconscious mind?\"):\n        scene_statements.append(\"Koishi makes them see illusions or confront their hidden weaknesses.\")\n\n    # 4. Does Koishi use her Spell Cards?\n    if check_scene(scene, \"Does Koishi use her Spell Cards?\"):\n        scene_statements.append(\"Koishi manipulates the unconscious minds of those around her, making them face their inner fears or desires.\")\n\n    return scene_statements", "def parse_by_scene(scene):\n    scene_statements = []\n\n    # 1. Is the scene at the Palace of the Earth Spirits or with its residents?\n    if check_scene(scene, \"Is the scene at the Palace of the Earth Spirits or with its residents?\"):\n        scene_statements.append(\"Koishi acts as a resident of the Palace of the Earth Spirits, showing familiarity and comfort.\")\n\n    # 2. Is the scene at the Myouren Temple or with its members (especially Byakuren Hijiri)?\n    elif check_scene(scene, \"Is the scene at the Myouren Temple or with its members?\"):\n        scene_statements.append(\"Koishi behaves as a recent convert to Buddhism, showing curiosity and willingness to learn.\")\n\n    # 3. Are Buddhist teachings, practices, or beliefs being discussed?\n    elif check_scene(scene, \"Are Buddhist teachings, practices, or beliefs being discussed?\"):\n        scene_statements.append(\"Koishi expresses interest in Buddhist ideas, asking questions or trying to apply them.\")\n\n    # 4. Is Koishi's dual affiliation (home and faith) relevant in the scene?\n    elif check_scene(scene, \"Is Koishi's dual affiliation (her home and her faith) relevant in the scene?\"):\n        scene_statements.append(\"Koishi mentions both her residence at the Palace and her new connection to the Myouren Temple, possibly showing eagerness or mild conflict.\")\n\n    return scene_statements", "def parse_by_scene(scene):\n    scene_statements = []\n\n    # 1. Is Koishi seeking power or blessing for her pets?\n    if check_scene(scene, \"Is Koishi seeking power or a blessing for her pets?\"):\n        scene_statements.append(\"Koishi approaches Kanako Yasaka or others to request a blessing for her pets, showing determination.\")\n\n    # 2. Is Koishi interacting with her pets?\n    if check_scene(scene, \"Is Koishi with her pets?\"):\n        scene_statements.append(\"Koishi shows care and affection for her pets, possibly expressing a desire for them to be stronger like Satori's pets.\")\n\n    # 3. Does Koishi possess the Mask of Hope in this scene?\n    has_mask = check_scene(scene, \"Does Koishi possess the Mask of Hope?\")\n    if has_mask:\n        # 4. Is Koishi influenced by hope in this scene?\n        if check_scene(scene, \"Is Koishi influenced by hope in this scene?\"):\n            scene_statements.append(\"Koishi temporarily exhibits hopefulness and optimism, acting more proactive and cheerful than usual.\")\n        else:\n            scene_statements.append(\"Koishi possesses the Mask of Hope, which may influence her emotions.\")\n\n    return scene_statements"]